In [361]:
import pandas as pd
import numpy as np
import requests

## read the JSON file that you saved in ex02

In [362]:
dataset_link = "https://drive.google.com/file/d/1djlN-ujJm1IL6j-ePaygIMxNHKf8P7D9/view?usp=sharing"
file_id = dataset_link.split("/")[-2]
!gdown {file_id}
!ls

Downloading...
From: https://drive.google.com/uc?id=1djlN-ujJm1IL6j-ePaygIMxNHKf8P7D9
To: /Users/dhawkgir/ds/day05/ex04/auto.json
100%|██████████████████████████████████████| 64.1k/64.1k [00:00<00:00, 2.22MB/s]
auto.json        fines.csv        surname.json
enrichment.ipynb owners.csv

In [363]:
file_name = 'auto.json'

In [364]:
df = pd.read_json(file_name, orient='records')

In [365]:
pd.options.display.float_format = '{:.2f}'.format

In [366]:
df

        CarNumber  Refund    Fines    Make    Model
0    Y163O8161RUS       2  3200.00    Ford    Focus
1     E432XX77RUS       1  6500.00  Toyota    Camry
2     7184TT36RUS       1  2100.00    Ford    Focus
3    X582HE161RUS       2  2000.00    Ford    Focus
4    92918M178RUS       1  5700.00    Ford    Focus
..            ...     ...      ...     ...      ...
720  Y163O8161RUS       2  1600.00    Ford    Focus
721  M0309X197RUS       1 22300.00    Ford    Focus
722  O673E8197RUS       2   600.00    Ford    Focus
723  8610T8154RUS       1  2000.00    Ford    Focus
724  H419XE197RUS       2  8594.59  Toyota  Corolla

[725 rows x 5 columns]

In [367]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 725 entries, 0 to 724
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CarNumber  725 non-null    object
 1   Refund     725 non-null    int64
 2   Fines      725 non-null    float64
 3   Make       725 non-null    object
 4   Model      716 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 28.4+ KB

## enrich the dataframe using a sample from that dataframe

In [368]:
samples = 200
random_state = 21

In [369]:
np.random.seed(random_state)

In [370]:
enrich_df = df.iloc[np.random.randint(0, len(df), samples)]
enrich_df

        CarNumber  Refund    Fines        Make   Model
207  Y351O8197RUS       1  1500.00        Ford   Focus
48    H917TC36RUS       2  4000.00        Ford   Focus
368  C589EY154RUS       1  4500.00        Ford   Focus
120   K846YE77RUS       2  2000.00  Volkswagen  Passat
419  X4108H125RUS       2  1300.00        Ford   Focus
..            ...     ...      ...         ...     ...
587  M942OT152RUS       1  2000.00        Ford   Focus
595  Y187O8161RUS       2   400.00        Ford   Focus
365  7064C8197RUS       1 12800.00  Volkswagen  Passat
474  8437XX154RUS       2   800.00        Ford   Focus
592   C410X938RUS       2  2200.00        Ford   Focus

[200 rows x 5 columns]

In [371]:
pd.set_option('mode.chained_assignment', None)

In [372]:
enrich_df.loc[:, ['Refund']] = np.random.randint(df.Refund.min(), df.Refund.max() + 1, samples)
enrich_df.loc[:, ['Fines']] = df.Fines.max() * np.random.random(samples)
enrich_df

        CarNumber  Refund     Fines        Make   Model
207  Y351O8197RUS       2 168558.07        Ford   Focus
48    H917TC36RUS       2 135334.21        Ford   Focus
368  C589EY154RUS       1 102219.25        Ford   Focus
120   K846YE77RUS       2  64799.03  Volkswagen  Passat
419  X4108H125RUS       2 118728.93        Ford   Focus
..            ...     ...       ...         ...     ...
587  M942OT152RUS       1 174828.71        Ford   Focus
595  Y187O8161RUS       1 178191.32        Ford   Focus
365  7064C8197RUS       2  63548.89  Volkswagen  Passat
474  8437XX154RUS       2 147950.60        Ford   Focus
592   C410X938RUS       1 151165.80        Ford   Focus

[200 rows x 5 columns]

In [373]:
concat_rows = pd.concat([df, enrich_df], ignore_index=True)
concat_rows

        CarNumber  Refund     Fines        Make   Model
0    Y163O8161RUS       2   3200.00        Ford   Focus
1     E432XX77RUS       1   6500.00      Toyota   Camry
2     7184TT36RUS       1   2100.00        Ford   Focus
3    X582HE161RUS       2   2000.00        Ford   Focus
4    92918M178RUS       1   5700.00        Ford   Focus
..            ...     ...       ...         ...     ...
920  M942OT152RUS       1 174828.71        Ford   Focus
921  Y187O8161RUS       1 178191.32        Ford   Focus
922  7064C8197RUS       2  63548.89  Volkswagen  Passat
923  8437XX154RUS       2 147950.60        Ford   Focus
924   C410X938RUS       1 151165.80        Ford   Focus

[925 rows x 5 columns]

## enrich the dataframe concat_rows by a new column with the data generated

In [374]:
np.random.seed(random_state)

In [375]:
Year = pd.Series(np.random.randint(1980, 2019+1, len(concat_rows)), name='Year')
Year

0      1989
1      1995
2      1984
3      2015
4      2014
       ...
920    1981
921    1992
922    2007
923    2005
924    1997
Name: Year, Length: 925, dtype: int64

In [376]:
fines = concat_rows.merge(Year, left_index=True, right_index=True)
fines

        CarNumber  Refund     Fines        Make   Model  Year
0    Y163O8161RUS       2   3200.00        Ford   Focus  1989
1     E432XX77RUS       1   6500.00      Toyota   Camry  1995
2     7184TT36RUS       1   2100.00        Ford   Focus  1984
3    X582HE161RUS       2   2000.00        Ford   Focus  2015
4    92918M178RUS       1   5700.00        Ford   Focus  2014
..            ...     ...       ...         ...     ...   ...
920  M942OT152RUS       1 174828.71        Ford   Focus  1981
921  Y187O8161RUS       1 178191.32        Ford   Focus  1992
922  7064C8197RUS       2  63548.89  Volkswagen  Passat  2007
923  8437XX154RUS       2 147950.60        Ford   Focus  2005
924   C410X938RUS       1 151165.80        Ford   Focus  1997

[925 rows x 6 columns]

## enrich the dataframe with the data from another dataframe

In [377]:
surname_link = 'https://drive.google.com/file/d/1uulthlFMcF1S29sxDw_9AWKXf7OhaamX/view?usp=sharing'
file_id = surname_link.split("/")[-2]
!gdown {file_id}
!ls

Downloading...
From: https://drive.google.com/uc?id=1uulthlFMcF1S29sxDw_9AWKXf7OhaamX
To: /Users/dhawkgir/ds/day05/ex04/surname.json
100%|██████████████████████████████████████| 2.62k/2.62k [00:00<00:00, 8.64MB/s]
auto.json        fines.csv        surname.json
enrichment.ipynb owners.csv

In [378]:
surname_file = 'surname.json'
df_sn = pd.read_json(surname_file)
df_sn

            0        1     2
0        NAME    COUNT  RANK
1       ADAMS   427865    42
2       ALLEN   482607    33
3     ALVAREZ   233983    92
4    ANDERSON   784404    15
..        ...      ...   ...
96   WILLIAMS  1625252     3
97     WILSON   801882    14
98       WOOD   250715    84
99     WRIGHT   458980    35
100     YOUNG   484447    32

[101 rows x 3 columns]

In [379]:
try:
    df_sn.columns = df_sn.loc[0]
    df_sn.drop(0, inplace=True)
except:
    pass
df_sn.reset_index(drop=True, inplace=True)
df_sn

0       NAME    COUNT RANK
0      ADAMS   427865   42
1      ALLEN   482607   33
2    ALVAREZ   233983   92
3   ANDERSON   784404   15
4     BAILEY   277845   72
..       ...      ...  ...
95  WILLIAMS  1625252    3
96    WILSON   801882   14
97      WOOD   250715   84
98    WRIGHT   458980   35
99     YOUNG   484447   32

[100 rows x 3 columns]

In [380]:
np.random.seed(random_state)
surnames = pd.Series(df_sn.NAME[np.random.randint(len(df_sn), size=fines.CarNumber.nunique())].reset_index(drop=True),
                     name='SURNAME', index=None)
surnames

0      RICHARDSON
1            ROSS
2          MORGAN
3          BAILEY
4           LOPEZ
          ...
526      CAMPBELL
527          HALL
528         BAKER
529          DIAZ
530        MORGAN
Name: SURNAME, Length: 531, dtype: object

In [381]:
owners = pd.concat([pd.Series(fines.CarNumber.unique(), name='CarNumber'), surnames], axis=1)
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
526  O136HO197RUS    CAMPBELL
527  O22097197RUS        HALL
528  M0309X197RUS       BAKER
529  O673E8197RUS        DIAZ
530  8610T8154RUS      MORGAN

[531 rows x 2 columns]

In [382]:
len(owners)

531

In [383]:
new_fines = pd.DataFrame([['X666XX666EU', 3, 4521, 'Kia', 'Ceed', 2020],
                          ['X222XX531EU', 2, 5321, 'Kia', 'Rio', 2021],
                          ['X111XX327EU', 1, 6321, 'BMW', 'X4', 2022],
                          ['X333XX36EU', 1, 321, 'BMW', 'X3', 2009],
                          ['X444XX66EU', 3, 53231, 'BMW', 'X5', 2019],
                          ], columns=fines.columns)
fines = pd.concat([fines, new_fines], ignore_index=True)
fines.drop_duplicates(inplace=True)
fines

        CarNumber  Refund    Fines    Make  Model  Year
0    Y163O8161RUS       2  3200.00    Ford  Focus  1989
1     E432XX77RUS       1  6500.00  Toyota  Camry  1995
2     7184TT36RUS       1  2100.00    Ford  Focus  1984
3    X582HE161RUS       2  2000.00    Ford  Focus  2015
4    92918M178RUS       1  5700.00    Ford  Focus  2014
..            ...     ...      ...     ...    ...   ...
925   X666XX666EU       3  4521.00     Kia   Ceed  2020
926   X222XX531EU       2  5321.00     Kia    Rio  2021
927   X111XX327EU       1  6321.00     BMW     X4  2022
928    X333XX36EU       1   321.00     BMW     X3  2009
929    X444XX66EU       3 53231.00     BMW     X5  2019

[930 rows x 6 columns]

In [384]:
new_owners = pd.DataFrame([['X676XR666EU', 'Petr'],
                          ['X272XR531EU', 'Ildar'],
                          ['X171XR327EU', 'Denim', ],
                          ], columns=owners.columns)
owners.drop(owners.tail(20).index, inplace=True)
owners = pd.concat([owners, new_owners], ignore_index=True)

In [385]:
fines.merge(owners, how='inner')

        CarNumber  Refund     Fines    Make    Model  Year     SURNAME
0    Y163O8161RUS       2   3200.00    Ford    Focus  1989  RICHARDSON
1    Y163O8161RUS       2   1600.00    Ford    Focus  1980  RICHARDSON
2    Y163O8161RUS       2 102737.38    Ford    Focus  2019  RICHARDSON
3    Y163O8161RUS       1 145631.15    Ford    Focus  2017  RICHARDSON
4    Y163O8161RUS       1  68990.84    Ford    Focus  2017  RICHARDSON
..            ...     ...       ...     ...      ...   ...         ...
898  T914CT197RUS       2 163130.42  Toyota    Camry  2005   HERNANDEZ
899  E41977152RUS       2   2400.00    Ford    Focus  1989       BAKER
900  9464EX178RUS       2   2100.00    Ford    Focus  1988      MARTIN
901  O50197197RUS       2   7800.00    Ford    Focus  1992      WRIGHT
902  7608EE777RUS       1   4000.00   Skoda  Octavia  2000        HILL

[903 rows x 7 columns]

In [386]:
fines.merge(owners, how='outer')

        CarNumber  Refund     Fines  Make  Model    Year     SURNAME
0    Y163O8161RUS    2.00   3200.00  Ford  Focus 1989.00  RICHARDSON
1    Y163O8161RUS    2.00   1600.00  Ford  Focus 1980.00  RICHARDSON
2    Y163O8161RUS    2.00 102737.38  Ford  Focus 2019.00  RICHARDSON
3    Y163O8161RUS    1.00 145631.15  Ford  Focus 2017.00  RICHARDSON
4    Y163O8161RUS    1.00  68990.84  Ford  Focus 2017.00  RICHARDSON
..            ...     ...       ...   ...    ...     ...         ...
928    X333XX36EU    1.00    321.00   BMW     X3 2009.00         NaN
929    X444XX66EU    3.00  53231.00   BMW     X5 2019.00         NaN
930   X676XR666EU     NaN       NaN   NaN    NaN     NaN        Petr
931   X272XR531EU     NaN       NaN   NaN    NaN     NaN       Ildar
932   X171XR327EU     NaN       NaN   NaN    NaN     NaN       Denim

[933 rows x 7 columns]

In [387]:
fines.merge(owners, how='left')

        CarNumber  Refund    Fines    Make  Model  Year     SURNAME
0    Y163O8161RUS       2  3200.00    Ford  Focus  1989  RICHARDSON
1     E432XX77RUS       1  6500.00  Toyota  Camry  1995        ROSS
2     7184TT36RUS       1  2100.00    Ford  Focus  1984      MORGAN
3    X582HE161RUS       2  2000.00    Ford  Focus  2015      BAILEY
4    92918M178RUS       1  5700.00    Ford  Focus  2014       LOPEZ
..            ...     ...      ...     ...    ...   ...         ...
925   X666XX666EU       3  4521.00     Kia   Ceed  2020         NaN
926   X222XX531EU       2  5321.00     Kia    Rio  2021         NaN
927   X111XX327EU       1  6321.00     BMW     X4  2022         NaN
928    X333XX36EU       1   321.00     BMW     X3  2009         NaN
929    X444XX66EU       3 53231.00     BMW     X5  2019         NaN

[930 rows x 7 columns]

In [388]:
fines.merge(owners, how='right')

        CarNumber  Refund     Fines   Make    Model    Year     SURNAME
0    Y163O8161RUS    2.00   3200.00   Ford    Focus 1989.00  RICHARDSON
1    Y163O8161RUS    2.00   1600.00   Ford    Focus 1980.00  RICHARDSON
2    Y163O8161RUS    2.00 102737.38   Ford    Focus 2019.00  RICHARDSON
3    Y163O8161RUS    1.00 145631.15   Ford    Focus 2017.00  RICHARDSON
4    Y163O8161RUS    1.00  68990.84   Ford    Focus 2017.00  RICHARDSON
..            ...     ...       ...    ...      ...     ...         ...
901  O50197197RUS    2.00   7800.00   Ford    Focus 1992.00      WRIGHT
902  7608EE777RUS    1.00   4000.00  Skoda  Octavia 2000.00        HILL
903   X676XR666EU     NaN       NaN    NaN      NaN     NaN        Petr
904   X272XR531EU     NaN       NaN    NaN      NaN     NaN       Ildar
905   X171XR327EU     NaN       NaN    NaN      NaN     NaN       Denim

[906 rows x 7 columns]

## create a pivot table from the fines dataframe

In [389]:
pd.pivot_table(fines, index=['Make', 'Model'], columns='Year', values='Fines', aggfunc=np.sum)

Year                    1980      1981      1982      1983      1984  \
Make       Model
BMW        X3            NaN       NaN       NaN       NaN       NaN
           X4            NaN       NaN       NaN       NaN       NaN
           X5            NaN       NaN       NaN       NaN       NaN
Ford       Focus   351002.31 859546.19 501227.12 385576.30 145593.54
           Mondeo        NaN       NaN       NaN       NaN       NaN
Kia        Ceed          NaN       NaN       NaN       NaN       NaN
           Rio           NaN       NaN       NaN       NaN       NaN
Skoda      Octavia  34264.94       NaN   6900.00  11594.59  97608.97
Toyota     Camry   108833.42   8594.59       NaN   7200.00       NaN
           Corolla       NaN       NaN   2000.00       NaN       NaN
Volkswagen Golf     30900.00       NaN       NaN   8594.59    300.00
           Jetta         NaN       NaN       NaN       NaN       NaN
           Passat        NaN  99634.17       NaN   3200.00  10000.00
           Touareg       NaN       NaN       NaN       NaN       NaN

Year                    1985      1986      1987      1988      1989  ...  \
Make       Model                                                      ...
BMW        X3            NaN       NaN       NaN       NaN       NaN  ...
           X4            NaN       NaN       NaN       NaN       NaN  ...
           X5            NaN       NaN       NaN       NaN       NaN  ...
Ford       Focus   635789.50 220328.80 462814.20 527992.30 223755.33  ...
           Mondeo        NaN       NaN       NaN       NaN   8600.00  ...
Kia        Ceed          NaN       NaN       NaN       NaN       NaN  ...
           Rio           NaN       NaN       NaN       NaN       NaN  ...
Skoda      Octavia  10294.59    600.00 188118.76       NaN  91400.00  ...
Toyota     Camry         NaN       NaN       NaN       NaN  22400.00  ...
           Corolla       NaN 148150.68   8000.00       NaN   4000.00  ...
Volkswagen Golf     24000.00       NaN   9300.00       NaN  39458.35  ...
           Jetta         NaN       NaN       NaN       NaN       NaN  ...
           Passat    5000.00  15000.00  12300.00       NaN       NaN  ...
           Touareg   5800.00       NaN       NaN       NaN       NaN  ...

Year                    2013      2014      2015      2016      2017  \
Make       Model
BMW        X3            NaN       NaN       NaN       NaN       NaN
           X4            NaN       NaN       NaN       NaN       NaN
           X5            NaN       NaN       NaN       NaN       NaN
Ford       Focus   562390.19 390194.62 695912.96 303433.76 831880.25
           Mondeo        NaN       NaN       NaN  46200.00       NaN
Kia        Ceed          NaN       NaN       NaN       NaN       NaN
           Rio           NaN       NaN       NaN       NaN       NaN
Skoda      Octavia 189468.31 261765.22  46394.59    300.00       NaN
Toyota     Camry         NaN       NaN       NaN 165506.53  77751.71
           Corolla       NaN       NaN       NaN       NaN   9600.00
Volkswagen Golf    106949.44       NaN   2300.00       NaN       NaN
           Jetta         NaN       NaN       NaN       NaN       NaN
           Passat   36608.94       NaN 173824.38   2100.00       NaN
           Touareg       NaN   1300.00    500.00       NaN       NaN

Year                    2018      2019    2020    2021    2022
Make       Model
BMW        X3            NaN       NaN     NaN     NaN     NaN
           X4            NaN       NaN     NaN     NaN 6321.00
           X5            NaN  53231.00     NaN     NaN     NaN
Ford       Focus   725054.77 412027.52     NaN     NaN     NaN
           Mondeo        NaN       NaN     NaN     NaN     NaN
Kia        Ceed          NaN       NaN 4521.00     NaN     NaN
           Rio           NaN       NaN     NaN 5321.00     NaN
Skoda      Octavia 156200.00   9500.00     NaN     NaN     NaN
Toyota     Camry    13000.00  18100.00     NaN     NaN     NaN
           Corolla       NaN 128029.38     NaN     NaN     NaN
Volkswagen Golf          NaN       NaN     NaN     NaN     NaN
           Jetta         NaN       NaN     NaN     NaN     NaN
           Passat        NaN       NaN     NaN     NaN     NaN
           Touareg       NaN       NaN     NaN     NaN     NaN

[14 rows x 43 columns]

## save both the fines and owners dataframes to CSV files without an index

In [390]:
fines.to_csv('fines.csv', index=False)
owners.to_csv('owners.csv', index=False)